docs/site/20210511170700-setup_for_electroacoustic_music.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-29 Wed 22:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Setup for Electroacoustic Music</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Setup for Electroacoustic Music</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org60692c2">Speakers</a></li>
<li><a href="#org2de5bbc">Soundcheck</a></li>
<li><a href="#org89224bf">Microphones and Bocals</a></li>
<li><a href="#org5ad19c0">Pedals</a></li>
</ul>
</div>
</div>
<p>
There are many aspects of a successful setup for electroacoustic music
</p>

<p>
A basic overview of equipment is given in <a href="20220412160216-jordan18_eq.html#ID-635f93aa-7721-4c76-9155-3bf8cfe55594">jordan18-eq</a>
</p>

<div id="outline-container-org60692c2" class="outline-2">
<h2 id="org60692c2">Speakers</h2>
<div class="outline-text-2" id="text-org60692c2">
<p>
Speakers ideally should be set about 30&deg; from center, perhaps more in large spaces, and raised.
</p>

<p>
<a href="20210511170400-morrill81_setup.html#ID-0f84b67d-8375-49a1-a8f9-aeded4a59c81">morrill81_setup</a>
</p>

<p>
Perhaps a better way to fill in "holes" in the stereo image is to have multiple speakers with the same signal. <a href="20210527115700-macdonald95_speakers.html#ID-f8904c79-d61b-4085-b56c-69eeb6284192">macdonald95org-noter-speakers</a>
</p>
</div>
</div>

<div id="outline-container-org2de5bbc" class="outline-2">
<h2 id="org2de5bbc">Soundcheck</h2>
<div class="outline-text-2" id="text-org2de5bbc">
<p>
  Having adequate time to sound check the hardware, before the dress rehearsal, is crucial. <a href="20210513093200-mcnutt03_difficulties.html#ID-1a6433b1-bfe2-4edb-a771-1e42fc2a9902">mcnutt03-difficulties</a>
It is also important to know where equipment is coming from. <a href="20220404161616-grew14_difficulties.html#ID-ac6466c2-4b45-44cd-8cb8-4ca88295b15b">grew14-difficulties</a>
</p>
</div>
</div>
<div id="outline-container-org89224bf" class="outline-2">
<h2 id="org89224bf">Microphones and Bocals</h2>
<div class="outline-text-2" id="text-org89224bf">
<p>
  Microphones can give the most accurate sound, but sometimes there are issues with feedback. Most people use two microphones, one at the bell for the lowest notes, and one aimed towards the left hand fingers. This blend does well to capture all notes of the bassoon.  Bocals pick up all notes more or less evenly, but they don't sound the same as an acoustic bassoon.  The telex pickup has a strong signal, but is a bit honky. The little jake pickup requires a preamp, and is a bit heavy in the bass. A volume pedal is advised for this setup to help with the reduced dynamic range of a pickup. <a href="20210604142500-romine13_equipment.html#ID-3b803a3f-371b-48f2-9e72-7e0b471adf79">romine13-equipment</a>
It is important with microphones to understand the type of microphone and polar pattern to avoid feedback issues. <a href="20220404161907-grew14_microphones.html#ID-bc9c653f-47e1-4470-af6e-79f128abd2ce">grew14-microphones</a>
</p>

<p>
<a href="20211013142209-behr14_gear.html#ID-6e5ae75d-944b-4152-adc0-bc4f8145493b">behr14-gear</a> has more info about microphones and bocals.
</p>
</div>
</div>

<div id="outline-container-org5ad19c0" class="outline-2">
<h2 id="org5ad19c0">Pedals</h2>
<div class="outline-text-2" id="text-org5ad19c0">
<p>
overview of common pedals and their effects. <a href="20211013142209-behr14_gear.html#ID-6e5ae75d-944b-4152-adc0-bc4f8145493b">behr14-gear</a>
</p>

<p>
More in depth descriptions in <a href="20220228105640-hunter04_pedals.html#ID-ef47ef15-9d86-4103-b67a-a82446c7dc4d">hunter04-pedals</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
